Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/InformationRegisters/ПС_ОбработкаДокументов/ПС_ОбработкаДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПС_ОбработкаДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Распознан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Найден</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прикреплен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Создан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИзвлеченныйТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вероятность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеРеквизиты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ПС_ТипыРаспознанныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеСодержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксПолейКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксПолейОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/Catalogs/ПС_ОсобенностиЗагрузкиФормДокументов/ПС_ОсобенностиЗагрузкиФормДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПС_ОсобенностиЗагрузкиФормДокументов</name>
  <attributes>
    <name>ОКУД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузкиСтрок</name>
    <type>
      <types>EnumRef.ПС_ВариантыЗагрузкиСтрок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВДокументеВсегдаУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляУслугПоУмолчанию</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйВариантИдентификацииСторон</name>
    <type>
      <types>EnumRef.ПС_ВариантыИдентификацииСторонДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьКонтрагентовАвтоматическиПриЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаполнениеСчетовУчета</name>
    <attributes>
      <name>РеквизитШапки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСчетаУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/CommonModules/ПС_СозданиеНовыхОбъектовВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Создает контрагента по данным распознавания
// 
// Параметры:
//  ЗаписьРегистра - Структура - данные распознавания
// 
// Возвращаемое значение:
//  СправочникСсылка.Контрагенты - ссылка на созданный контрагент
Функция СоздатьКонтрагентаПоРаспознаннымДанным(Знач ЗаписьРегистра) Экспорт

	//Определение конфигурации
	//Определение типа документа
	//Определения модуля заполнения выбранного документа
	
	МодульСозданияДокументов = Неопределено;
	
	Если СтрНайти(ВРег(Метаданные.Имя), "ТОРГОВЛЕЙ") > 0 Тогда
		
		//Пока не предусмотрено
		
	ИначеЕсли СтрНайти(ВРег(Метаданные.Имя), "БУХГАЛТЕРИЯ") > 0 Тогда
		
		УстановитьБезопасныйРежим(Истина);
		МодульСозданияДокументов = Вычислить("ПС_СозданиеДокументовБухгалтерияПредприятия");
		УстановитьБезопасныйРежим(Ложь);
		
	КонецЕсли;
	
	Если МодульСозданияДокументов = Неопределено Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Автоматическое создание контрагентов в данной конфигурации не предусмотрено";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДанныеРаспознавания = Неопределено;
	
	Если ТипЗнч(ЗаписьРегистра) = Тип("Структура") Тогда
		
		ДанныеРаспознавания = ЗаписьРегистра;
		
		Если НЕ ДанныеРаспознавания.Свойство("Реквизиты") Тогда
			
			ПС_ИндексацияФайловВызовСервера.СериализоватьВсеДанныеРаспознавания(ДанныеРаспознавания);
			
		КонецЕсли;
		
	Иначе
		
		ДанныеРаспознавания = ПС_ИндексацияФайловВызовСервера.ДанныеОдногоФайлаПоХешСумме(ЗаписьРегистра.ХешСумма, ЗаписьРегистра.Объект);
		ПС_ИндексацияФайловВызовСервера.СериализоватьВсеДанныеРаспознавания(ДанныеРаспознавания);
		
	КонецЕсли;
	
	Если ДанныеРаспознавания.Распознан Тогда
	
		Возврат МодульСозданияДокументов.СоздатьКонтрагента(ДанныеРаспознавания);	
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Документ не распознан";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
				
	КонецЕсли;
	
КонецФункции

// Возвращает настройки загрузки документа по ОКУД
//
// Параметры:
//  ОКУД - Строка - ОКУД документа
//
// Возвращаемое значение:
//  Структура, Неопределено - настройки загрузки документа
Функция ПолучитьНастройкиЗагрузкиДокумента(ОКУД) Экспорт
	
	Если ПустаяСтрока(ОКУД) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ЗапросНастроек = Новый Запрос();
	ЗапросНастроек.Текст = "ВЫБРАТЬ
	|	ПС_ОсобенностиЗагрузкиФормДокументов.Ссылка КАК Ссылка,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ВариантЗагрузкиСтрок КАК ВариантЗагрузкиСтрок,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ВДокументеВсегдаУслуги КАК ВДокументеВсегдаУслуги,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.НоменклатураДляУслугПоУмолчанию КАК НоменклатураДляУслугПоУмолчанию,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ПриоритетныйВариантИдентификацииСторон КАК
	|		ПриоритетныйВариантИдентификацииСторон,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.СоздаватьКонтрагентовАвтоматическиПриЗагрузке КАК
	|		СоздаватьКонтрагентовАвтоматическиПриЗагрузке,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ОКУД КАК ОКУД
	|ИЗ
	|	Справочник.ПС_ОсобенностиЗагрузкиФормДокументов КАК ПС_ОсобенностиЗагрузкиФормДокументов
	|ГДЕ
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ОКУД ПОДОБНО &ОКУД";
	
	ЗапросНастроек.Параметры.Вставить("ОКУД", "%" + ОКУД + "%");
	
	ТаблицаРезультат = ЗапросНастроек.Выполнить().Выгрузить();
	
	Если ТаблицаРезультат.Количество() > 0 Тогда
	
		Для каждого ТекСтрокаНастроек Из ТаблицаРезультат Цикл
		
			МассивОКУД = СтрРазделить(ТекСтрокаНастроек.ОКУД, ",");
			
			Если МассивОКУД.Найти(ОКУД) <> Неопределено Тогда
	
				СтруктураРезультат = Новый Структура;
				
				Для каждого ТекКолонка Из ТаблицаРезультат.Колонки Цикл
				
					СтруктураРезультат.Вставить(ТекКолонка.Имя, ТекСтрокаНастроек[ТекКолонка.Имя]);
					
				КонецЦикла;
				
				Возврат СтруктураРезультат;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Создает документ по распознанным данным
// Параметры:
//	ХешСумма - Строка - Хеш сумма файла
//	Идентификатор - Строка - Идентификатор файла
//	ДополнительныеПараметры - Структура - Дополнительные параметры
//	ОбновитьДокумент - Булево - Признак обновления документа
// Возвращаемое значение:
//	ДокументСсылка - Документ по распознанным данным
Функция СоздатьДокументПоРаспознаннымДанным(ХешСумма, Идентификатор, ДополнительныеПараметры, ОбновитьДокумент = Ложь) Экспорт

	//Определение конфигурации
	//Определение типа документа
	//Определения модуля заполнения выбранного документа
	
	
	МодульСозданияДокументов = Неопределено;
	
	Если СтрНайти(ВРег(Метаданные.Имя), "ТОРГОВЛЕЙ") > 0 Тогда
		
		//Пока не предусмотрено
		
	ИначеЕсли СтрНайти(ВРег(Метаданные.Имя), "БУХГАЛТЕРИЯ") > 0 Тогда
		
		УстановитьБезопасныйРежим(Истина);
		МодульСозданияДокументов = Вычислить("ПС_СозданиеДокументовБухгалтерияПредприятия");
		УстановитьБезопасныйРежим(Ложь);
		
	КонецЕсли;
	
	Если МодульСозданияДокументов = Неопределено Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Автоматическое создание документов в данной конфигурации не предусмотрено";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДанныеРаспознавания = ПС_ИндексацияФайловВызовСервера.ДанныеОдногоФайлаПоХешСумме(ХешСумма, Идентификатор);
	
	Если ДанныеРаспознавания = Неопределено Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось получить данные распознавания";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;

	
	СтруктураКлючевыхРеквизитов = ПС_ИндексацияФайловВызовСервера.JSONВСтруктуру(ДанныеРаспознавания.КлючевыеРеквизиты);
	
	СоздаватьКонтрагентаАвтоматически = ПС_ИндексацияФайловВызовСервера.ПолучитьНастройкуРаспознавания("СоздаватьКонтрагентовАвтоматическиПриЗагрузке") = Истина;
		
	Если ЗначениеЗаполнено(СтруктураКлючевыхРеквизитов.OKUD) Тогда
		
		НастройкиЗагрузки = ПолучитьНастройкиЗагрузкиДокумента(СтруктураКлючевыхРеквизитов.OKUD);
		
	КонецЕсли;	
	
	Если НастройкиЗагрузки <> Неопределено Тогда
		
		СоздаватьКонтрагентаАвтоматически = НастройкиЗагрузки.СоздаватьКонтрагентовАвтоматическиПриЗагрузке;
		
	КонецЕсли;

	ПС_ИндексацияФайловВызовСервера.СериализоватьВсеДанныеРаспознавания(ДанныеРаспознавания);
	
	Если НЕ ЗначениеЗаполнено(ДанныеРаспознавания.Контрагент) И СоздаватьКонтрагентаАвтоматически Тогда
			
		Контрагент = СоздатьКонтрагентаПоРаспознаннымДанным(ДанныеРаспознавания);
		
		ДанныеРаспознавания.Контрагент = Контрагент;
		
		МенеджерЗаписи = РегистрыСведений.ПС_ОбработкаДокументов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ХешСумма = ХешСумма;
		МенеджерЗаписи.Объект = Идентификатор;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи.Контрагент = Контрагент;
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если ДанныеРаспознавания.Распознан Тогда
	
		Возврат МодульСозданияДокументов.СоздатьДокумент(ДанныеРаспознавания, ДополнительныеПараметры, ОбновитьДокумент);	
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось распознать документ";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
				
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
